#

@hh_ps = {
  'Абашево'        => ['Абашево',       'Аба'],
  'Барыш'          => ['Барыш',         'Бар'],
  'Венец'          => ['Венец',         'Вен'],
  'Вешкайма'       => ['Вешкайма',      'Веш'],
  'Волжская'       => ['Волжская',      'Вол'],
  'Восток'         => ['Восток',        'Вос'],
  'Дубники'        => ['Дубники',       'Дуб'],
  'Заря'           => ['Заря',          'Зар'],
  'Канаш'          => ['Канаш',         'Кан'],
  'Ключики'        => ['Ключики',       'Клю'].
  'Комсомольская'  => ['Комсомольская', 'Ком'],
  'Кремёнки'       => ['Кремёнки',      'Кре'],
  'Кузнецк'        => ['Кузнецк',       'Куз'],
  'Мокша'          => ['Мокша',         'Мок'],
  'Пачелма'        => ['Пачелма',       'Пач'],
  'Пенза-1'        => ['Пенза-1',       'Пен-1'],
  'Пенза-2'        => ['Пенза-2',       'Пен-2'],
  'Помары'         => ['Помары',        'Пом'],
  'Рузаевка'       => ['Рузаевка',      'Руз'],
  'Саранская'      => ['Саранская',     'Сар'],
  'Сердобск'       => ['Сердобск',      'Сер'],
  'Тюрлема'        => ['Тюрлема',       'Тюр'],
  'Ульяновская'    => ['Ульяновская',   'Уль'],
  'Центролит'      => ['Центролит',     'Цен'],
  'Черемшанская'   => ['Черемшанская',  'Чер'],
  'Чигашево'       => ['Чигашево',      'Чиг']
}

